.config/emacs/Emacs.org
#+TITLE: Emacs init.el
#+PROPERTY: header-args:emacs-lisp :tangle ~/.config/emacs/init.el

* Helper Functions

#+begin_src emacs-lisp
  (defun list-faces (pos)
    "Get the font faces at POS."
    (interactive "d")
    (message "All Faces: %s" (remq nil
                                   (list
                                    (get-char-property pos 'read-face-name)
                                    (get-char-property pos 'face)
                                    (plist-get (text-properties-at pos) 'face)))))
#+end_src

* Basic UI

#+begin_src emacs-lisp
  (menu-bar-mode -1)
  (tool-bar-mode -1)
  (scroll-bar-mode -1)
  (tooltip-mode -1)
  (set-fringe-mode 10) ;; Left and Right Border
  (load-theme 'doom-gruvbox 't)
  (setq inhibit-startup-message t)
  ;; (setq visible-bell t)

  ;; (set-frame-parameter (selected-frame) 'alpha '(90 . 90))
  ;; (add-to-list 'default-frame-alist '(alpha . (90 . 90)))

  ;; (set-fontset-font "fontset-default" nil "MesloLGS NF")
  (set-face-attribute 'default nil :font "Fira Code Retina" :height 105)
  (set-face-attribute 'fixed-pitch nil :font "Fira Code Retina")
  (set-face-attribute 'variable-pitch nil :font "FreeSans" :height 105 :weight 'normal)
#+end_src

** Usefull UI Stuff

#+begin_src emacs-lisp
  (show-paren-mode)

  (global-hl-line-mode)

  ;; Set the line number explicitly, to avoid it being reset to variable-pitch by org mode
  (set-face-attribute 'line-number nil :inherit 'fixed-pitch)
  (set-face-attribute 'line-number-current-line nil :background 'unspecified :inherit '(hl-line line-number))

  (setq display-line-numbers-type 'relative)
  (global-display-line-numbers-mode 1)
  ;; We don't need the line number in the modeline anymore
  (line-number-mode -1)
  ;; (column-number-mode)
#+end_src

*** Disable Line Numbers

#+begin_src emacs-lisp
  (dolist (mode '(term-mode-hook
                  vterm-mode-hook
                  eshell-mode-hook
                  shell-mode-hook
                  help-mode-hook
                  helpful-mode-hook
                  Info-mode-hook
                  apropos-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))
#+end_src

*** Disable Line Highlighting

#+begin_src emacs-lisp
  (dolist (mode '(term-mode-hook
                  vterm-mode-hook
                  eshell-mode-hook
                  shell-mode-hook))
    (add-hook mode (lambda () (setq-local global-hl-line-mode nil))))
#+end_src

** Mouse Scrolling

#+begin_src emacs-lisp
  (setq mouse-wheel-scroll-amount '(3))
  (setq mouse-wheel-flip-direction 't)
  (setq mouse-wheel-progressive-speed nil)
  (setq scroll-step 5)
#+end_src

** Scrollbars

#+begin_src emacs-lisp :tangle no
  ;; (setq-default scroll-bar-width 10)

  ;; (defun fab/scroll-bar-setup (frame)
  ;;   (scroll-bar-mode -1)
  ;;   (set-face-attribute 'scroll-bar frame :foreground "#7c6f64")
  ;;   (set-scroll-bar-mode 'right)
  ;;   (set-window-scroll-bars nil 10 'right 0 nil t)
  ;;   (set-window-scroll-bars (minibuffer-window frame) 0 nil 0 nil t))

  ;; Disable Scrollbars in Minibuffer
  ;; (add-hook 'after-make-frame-functions 'fab/scroll-bar-setup)
  ;; (fab/scroll-bar-setup nil)

  ;; (set-window-fringes
  ;;  (minibuffer-window frame) 0 0 nil t)))
#+end_src

* Package Management

#+begin_src emacs-lisp
  (require 'package)

  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
                           ("org" . "https://orgmode.org/elpa/")
                           ("elpa" . "https://elpa.gnu.org/packages/")))

  (package-initialize)
  (unless package-archive-contents
    (package-refresh-contents))
  (unless (package-installed-p 'use-package)
    (package-install 'use-package))

  (require 'use-package)
  (setq use-package-always-ensure t)
#+end_src

** Auto Updates

#+begin_src emacs-lisp
  (use-package auto-package-update
    :config
    (setq auto-package-update-interval 14)
    (setq auto-package-update-delete-old-versions t)
    (setq auto-package-update-prompt-before-update t)
    ;; (setq auto-package-update-hide-results t)
    (auto-package-update-maybe))
#+end_src

* Global Configs

#+begin_src emacs-lisp
  (setq backup-directory-alist `(("." . ,(expand-file-name "tmp/backups/" user-emacs-directory))))

  (global-auto-revert-mode)

  (electric-pair-mode)
#+end_src

** Recent Files

#+begin_src emacs-lisp
  (recentf-mode 1)
  (setq recentf-max-saved-items 100)
  (setq recentf-max-menu-items recentf-max-saved-items)
  ;; (recentf-cleanup) ;; TODO: Make Async or when loaded
  ;; (load "~/.config/emacs/recentf-minibuffer") ;; TODO: Change to require
#+end_src

** Indentation

#+begin_src emacs-lisp
  ;; (setq-default tab-width 2)
  ;; (setq-default evil-shift-width tab-width)

  ;; Don't use Tabs
  ;; (setq-default indent-tabs-mode nil)

  (setq tab-always-indent nil)
#+end_src

* Keybindings

#+begin_src emacs-lisp
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)
  (global-set-key (kbd "C-:") 'eval-expression)
#+end_src

** Evil

#+begin_src emacs-lisp
  (setq evil-emacs-state-cursor '("red" box))
  (setq evil-normal-state-cursor '("green" box))
  (setq evil-visual-state-cursor '("orange" box))
  (setq evil-insert-state-cursor '("lightblue" bar))
  (setq evil-replace-state-cursor '("red" hollow))
  (setq evil-operator-state-cursor '("red" hbar))
  (setq evil-motion-state-cursor '("orange" hbar))

  ;; (setq evil-want-C-w-in-emacs-state 't)
  (setq evil-want-Y-yank-to-eol 't)
  (setq evil-want-C-u-scroll 't)
  (setq evil-respect-visual-line-mode 't)
  (setq evil-split-window-below 't)
  (setq evil-vsplit-window-right 't)
  (setq evil-undo-system 'undo-redo)
  (setq evil-echo-state nil)
  (setq evil-want-keybinding nil)
  (setq evil-want-integration 't)

  ;; Start with forward searches by default (important for Swiper)
  (setq isearch-forward 't)
  ;; (setq evil-search-module 'evil-search)

  (use-package evil)
  (evil-mode 1)
  ;; (add-to-list 'evil-insert-state-modes 'vterm-mode)
  (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
#+end_src

*** Evil Extra Packages

#+begin_src emacs-lisp
  (use-package evil-surround
    :after evil
    :config
    (general-def '(normal visual) evil-surround-mode-map
      "s" 'evil-surround-region
      "S" 'evil-Surround-region)
    ;; TODO: Text objects for other common surround stuff
    (global-evil-surround-mode 1))
#+end_src

#+begin_src emacs-lisp
  (use-package evil-collection
    :after evil
    :config
    ;; (delete 'info evil-collection-mode-list)
    (evil-collection-init))
#+end_src

** Which-Key Setup

#+begin_src emacs-lisp
  (use-package which-key
    :init
    (setq which-key-idle-delay 0.1) ;; Can cause errors when 0
    (setq which-key-prefix-prefix "")
    ;; (setq which-key-allow-evil-operators 't)
    ;; (setq which-key-show-operator-state-maps 't)
    (which-key-mode))
  ;; (which-key-setup-side-window-right-bottom)
  (global-set-key (kbd "<C-tab>") 'which-key-show-top-level)
#+end_src

** Generel.el Setup

#+begin_src emacs-lisp
  (use-package general
    :config
    (general-evil-setup 't)
    (general-create-definer fab/leader-def
      :states '(normal visual)
      :prefix "SPC"))
#+end_src

** Basic Keybindings

#+begin_src emacs-lisp
  (general-def 'normal
    ;; "#"         'comment-line
    "<M-down>"  'evil-window-down
    "<M-left>"  'evil-window-left
    "<M-right>" 'evil-window-right
    "<M-up>"    'evil-window-up
    "C-w C-q"   'evil-quit
    "U"         'evil-redo
    ;; "/"         'swiper)
  )

  (general-def 'normal
    [remap evil-ret] '(lambda () (interactive) (evil-open-below 0) (evil-normal-state)) 
    "S-<return>" '(lambda () (interactive) (evil-open-above 0) (evil-normal-state)))

  (general-def 'insert
    ;; Terminal style paste
    "C-S-V" '(lambda () (interactive) (evil-paste-before 1) (right-char)))
#+end_src

#+begin_src emacs-lisp
  (general-def '(normal insert emacs visual) 'override
    "C-SPC" 'execute-extended-command
    "C-a" 'universal-argument)

  (general-def universal-argument-map
    "C-a" 'universal-argument-more)
#+end_src

#+begin_src emacs-lisp
#+end_src

#+begin_src emacs-lisp
  (fab/leader-def :infix "f"
    ""  '(:ignore t :wk "Files")
    "f" 'find-file
    "r" '(counsel-recentf :wk "Recent Files")
    "e" '((lambda () (interactive) (find-file "~/.config/emacs/Emacs.org"))   :wk "Emacs Init")
    "o" '((lambda () (interactive) (find-file "~/Notes/Org_Mode_Basics.org")) :wk "Org Notes"))
#+end_src

#+begin_src emacs-lisp
  (use-package evil-nerd-commenter
    :general ('(normal visual) "#" 'evilnc-comment-or-uncomment-lines))
#+end_src

