.config/emacs/Emacs.org
* Ivy

#+begin_src emacs-lisp
  (use-package ivy
    :diminish
    :bind (("C-s" . swiper)
           :map ivy-minibuffer-map
           ("TAB" . ivy-alt-done)
           ("C-g" . ivy-beginning-of-buffer)
           ("C-o" . ivy-occur)
           ("C-a" . ivy-dispatching-done)
           ("C-S-a" . ivy-dispatching-call)
           ("C-r" . ivy-restrict-to-matches)
           ("C-p" . yank)
           :map ivy-switch-buffer-map
           ("C-d" . ivy-switch-buffer-kill))
    :config
    (setq ivy-use-selectable-prompt 't)
    (setq ivy-wrap 't)
    ;; Ignore the the order of words
    (setq ivy-re-builders-alist '((t . ivy--regex-ignore-order)))
    ;; Don't show . and .. directories
    (setq ivy-extra-directories '())
    (fab/leader-def ivy-mode-map
      "I" '(ivy-resume :wk "Ivy Resume"))
    (ivy-mode 1))
#+end_src

** Ivy-Rich

#+begin_src emacs-lisp
  (use-package ivy-rich
    :config (setq ivy-rich-path-style 'abbrev)
    :init (ivy-rich-mode 1))
#+end_src

** Counsel

#+begin_src emacs-lisp
  (use-package counsel
    :after ivy
    ;; :bind (("M-x" . counsel-M-x)
    ;;        ("C-SPC" . counsel-M-x)
    ;;        ("C-x b" . counsel-switch-buffer)
    ;;        ("C-x C-f" . counsel-find-file))
    :config
    (setq ivy-initial-inputs-alist nil)
    (fab/leader-def ivy-mode-map
      "b" '(counsel-switch-buffer :wk "Buffers")
      "P" '(counsel-yank-pop :wk "Paste Kill Ring"))
    (counsel-mode 1))
#+end_src

** Prescient

#+begin_src emacs-lisp
  (use-package ivy-prescient
    :after counsel
    :init
    (setq prescient-sort-length-enable nil)
    (setq prescient-sort-full-matches-first 't)
    ;; Use normal ivy filtering
    (setq ivy-prescient-enable-filtering nil)
    ;; (setq ivy-prescient-retain-classic-highlighting t)
    :config
    (ivy-prescient-mode 1)
    (prescient-persist-mode 1))
#+end_src

** Custom Action

#+begin_src emacs-lisp
  (ivy-set-actions 't nil)
#+end_src

#+begin_src emacs-lisp
  (ivy-add-actions
   'counsel-switch-buffer
   '(("s" (lambda (BNAME) (interactive) (evil-window-split) (switch-to-buffer BNAME)) "Split")
     ("v" (lambda (BNAME) (interactive) (evil-window-vsplit) (switch-to-buffer BNAME)) "VSplit")))
#+end_src

#+begin_src emacs-lisp
  (ivy-add-actions
   'counsel-find-file
   '(("s" (lambda (FNAME) (interactive) (evil-window-split nil FNAME)) "Split")
     ("v" (lambda (FNAME) (interactive) (evil-window-vsplit nil FNAME)) "VSplit")))
#+end_src

* Helpful

#+begin_src emacs-lisp
  ;; TODO: Open in same window
  (use-package helpful
    :init
    (setq helpful-switch-buffer-function #'pop-to-buffer)
    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-variable)
    (counsel-describe-symbol-function #'helpful-symbol)
    :bind
    ;; ([remap describe-function] . counsel-describe-function)
    ([remap describe-command] . helpful-command) ;; TODO: Needed for what?
    ;; ([remap describe-variable] . counsel-describe-variable)
    ;; ([remap describe-symbol] . counsel-describe-symbol)
    ([remap describe-key] . helpful-key)
    ("C-h p" . helpful-at-point))
#+end_src

* Other UI Stuff

#+begin_src emacs-lisp
  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

#+begin_src emacs-lisp
  (use-package all-the-icons)
  (use-package doom-modeline
    :init
    (setq mode-line-percent-position nil)
    (doom-modeline-mode 1)
    :custom
    (doom-modeline-height 25)
    (doom-modeline-buffer-file-name-style 'truncate-with-project)
    (doom-modeline-buffer-encoding nil)
    (doom-modeline-indent-info 't)
    (doom-modeline-lsp nil)
    (doom-modeline-env-version nil))
  (use-package doom-themes)
#+end_src

** Ligatures

#+begin_src emacs-lisp
  (use-package ligature
    :load-path "~/.config/emacs/ligature.el"
    :config
    (ligature-set-ligatures 'prog-mode '("|||>" "<|||" "<==>" "<!--" "~~>" "***" "||=" "||>"
                                         ":::" "::=" "=:=" "===" "==>" "=!=" "=>>" "=<<" "=/=" "!=="
                                         ">=>" ">>=" ">>>" ">>-" ">->" "->>" "-->" "---" "-<<"
                                         "<~~" "<~>" "<*>" "<||" "<|>" "<$>" "<==" "<=>" "<=<" "<->"
                                         "<--" "<-<" "<<=" "<<-" "<<<" "<+>" "</>" "###" "#_(" "..<"
                                         "..." "+++" "/==" "///" "_|_" "www" "&&" "^=" "~~" "~@" "~="
                                         "~>" "~-" "**" "*>" "*/" "||" "|}" "|]" "|=" "|>" "|-" "{|"
                                         "[|" "]#" "::" ":=" ":>" ":<" "$>" "==" "=>" "!=" "!!" ">:"
                                         ">=" ">>" ">-" "-~" "-|" "->" "--" "-<" "<~" "<*" "<|" "<:"
                                         "<$" "<=" "<>" "<-" "<<" "<+" "</" "#{" "#[" "#:" "#=" "#!"
                                         "##" "#(" "#?" "#_" "%%" ".=" ".-" ".." ".?" "+>" "++" "?:"
                                         "?=" "?." "??" ";;" "/=" "/>" "//" "__" "~~" "://"))
    (global-ligature-mode 't)
    )
#+end_src

** Scrollbars 2

#+begin_src emacs-lisp
  (use-package yascroll
    :config
    (set-face-attribute 'yascroll:thumb-fringe nil :foreground "#3c3836" :background "#3c3836")
    (global-yascroll-bar-mode 1))
#+end_src

** Center Text

#+begin_src emacs-lisp
  (defun fab/center-text-visual (&optional width)
    (setq visual-fill-column-width (or width 80))
    (setq visual-fill-column-center-text t)
    (visual-fill-column-mode 1))

  (use-package visual-fill-column
    :hook ((org-mode     . (lambda () (fab/center-text-visual 90)))
           (helpful-mode . (lambda () (fab/center-text-visual 90)))
           (Info-mode    . (lambda () (fab/center-text-visual 100)))))
#+end_src

** Company Mode

#+begin_src emacs-lisp
  (defun fab/company-on-return ()
    "Complete Selection when a value is selected, otherwise insert a newline"
    (interactive)
    (if company-selection
        (company-complete-selection)
      (newline)))

  (use-package company
    :hook ((prog-mode lsp-mode) . company-mode)
    :config
    (general-def  company-mode-map
     "<tab>"     'company-indent-or-complete-common)
    (general-def  company-active-map
      ;; "<tab>"    'company-complete-selection
      "<tab>"    'company-complete
      "<return>" 'fab/company-on-return
      "<escape>" 'company-abort
      "<down>"   'company-select-next
      "<up>"     'company-select-previous)
    :custom
    (company-minimum-prefix-length 1)
    (company-idle-delay 0.0))
#+end_src

#+begin_src emacs-lisp
  (use-package company-box
    :after company
    :hook (company-mode . company-box-mode))
#+end_src

#+begin_src emacs-lisp
  (use-package company-prescient
    :after company
    :config
    (company-prescient-mode 1))
#+end_src

** Syntax Highlighting

#+begin_src emacs-lisp
  (use-package tree-sitter
    :config
    (global-tree-sitter-mode)
    (add-hook 'tree-sitter-after-on-hook #'tree-sitter-hl-mode))

  (use-package tree-sitter-langs
    :after tree-sitter)
#+end_src

** Posframes

#+begin_src emacs-lisp
  (setq posframe-mouse-banish nil)
#+end_src

*** Ivy Posframe

#+begin_src emacs-lisp :tangle no
  (use-package ivy-posframe
    :after ivy
    :config
    (ivy-posframe-mode))
#+end_src

*** Which Key Posframe

#+begin_src emacs-lisp :tangle no
  (use-package which-key-posframe
    :after which-key
    :config
    (which-key-posframe-mode))
#+end_src

* Programming Stuff

** LSP Mode

#+begin_src emacs-lisp
  (use-package flycheck
    :after lsp-mode) ;; TODO: Configure

  (use-package lsp-mode
    :commands (lsp lsp-deferred)
    :hook (lsp-mode . lsp-headerline-breadcrumb-mode)
    :init
    (setq lsp-keymap-prefix "C-l")
    (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
    ;; (setq lsp-signature-auto-activate nil)
    (setq lsp-signature-render-documentation nil)
    (setq lsp-modeline-diagnostics-enable nil)
    :config
    (lsp-enable-which-key-integration t)
    (fab/leader-def lsp-mode-map "l" (general-simulate-key "C-l" :which-key "LSP"))
    (general-def 'normal lsp-mode-map
      "C-<return>" 'lsp-find-definition))
#+end_src

#+begin_src emacs-lisp
  (use-package lsp-ui
    :after lsp-mode
    :custom
    (lsp-ui-sideline-delay 0)
    (lsp-ui-sideline-show-code-actions nil)
    (lsp-ui-sideline-show-diagnostics 't)
    (lsp-ui-sideline-update-mode 't)

    (lsp-ui-doc-enable nil) ;; TODO: Better Binding for Glance and Focus and customize frame
    (lsp-ui-doc-position 'at-point))
#+end_src

#+begin_src emacs-lisp
  (use-package lsp-ivy
    :after lsp-mode)
#+end_src

