.config/emacs/init.el

(add-hook 'c-mode-common-hook
          (lambda ()
            (font-lock-add-keywords nil
                                    '(("\\<\\([a-zA-Z_]*\\) *(" 1 font-lock-function-name-face)) 't)))

(use-package go-mode
  :mode "\\.go\\'"
  :hook (go-mode . lsp-deferred))

(defun fab/org-mode-setup ()
  (setq tab-width 2)
  (variable-pitch-mode 1)
  (display-line-numbers-mode 0)
  (visual-line-mode 1)
  (electric-pair-local-mode -1))

(defun fab/org-font-setup ()
  ;; Replace list hyphen with dot
  ;; (font-lock-add-keywords 'org-mode
  ;;                         '(("^ *\\([-]\\) "
  ;;                            (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

  ;; Set faces for heading levels
  (dolist (face '((org-level-1 . 2.0)
                  (org-level-2 . 1.5)
                  (org-level-3 . 1.25)
                  (org-level-4 . 1.15)
                  (org-level-5 . 1.05)
                  (org-level-6 . 1.0)
                  (org-level-7 . 1.0)
                  (org-level-8 . 1.0)))
    (set-face-attribute (car face) nil :font "FreeSans" :weight 'regular :height (cdr face)))

  (require 'org-indent)
  (set-face-attribute 'org-document-title nil :font "FreeSans" :weight 'bold :height 3.0)

  ;; Ensure that anything that should be fixed-pitch in Org files appears that way
  (set-face-attribute 'org-block nil    :inherit 'fixed-pitch)
  (set-face-attribute 'org-block-begin-line nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-checkbox nil  :inherit 'fixed-pitch)
  ;; (set-face-attribute 'org-code nil     :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-code nil     :inherit 'fixed-pitch)
  (set-face-attribute 'org-formula nil  :inherit 'fixed-pitch)
  (set-face-attribute 'org-latex-and-related nil  :inherit 'fixed-pitch)
  (set-face-attribute 'org-hide   nil   :inherit 'fixed-pitch)
  ;; (set-face-attribute 'org-indent nil   :inherit '(org-hide fixed-pitch))
  (set-face-attribute 'org-meta-line nil :foreground nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-document-info-keyword nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-keyword-face fixed-pitch))
  (set-face-attribute 'org-table nil    :inherit 'fixed-pitch)
  ;; (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch)))
  (set-face-attribute 'org-verbatim nil :inherit 'fixed-pitch))

(use-package org
  :pin org ;; Use Org-Mode Archive
  :hook (org-mode . fab/org-mode-setup)
  :config
  (setq org-ellipsis " ▾")
  (setq org-hide-emphasis-markers 't)
  (setq org-pretty-entities 't)
  (setq org-startup-with-latex-preview 't)
  (setq org-cycle-global-at-bob 't)
  ;; (setq org-startup-folded 't)
  (setq org-catch-invisible-edits 'smart)
  (setq org-M-RET-may-split-line nil)
  (setq org-fontify-quote-and-verse-blocks t)
  (setq org-highlight-latex-and-related '(latex))
  (setq org-list-indent-offset 1)
  (setq org-hide-leading-stars 't)
  (setq org-indent-indentation-per-level 2)
  (setq org-startup-indented 't)
  (setq org-edit-src-content-indentation 2)
  (setq org-format-latex-options (plist-put org-format-latex-options :scale 1.25))
  (setq org-preview-latex-image-directory (expand-file-name "ltximg/" user-emacs-directory))
  (require 'org-tempo)
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (fab/org-font-setup))

;; (use-package org-bullets
;;   :after org
;;   :hook (org-mode . org-bullets-mode)
;;   :custom
;;   (org-bullets-bullet-list '("◉" "◎" "●" "⊙" "○" "●" "◈" "◇")))

(use-package org-superstar
  :after org
  :hook (org-mode . org-superstar-mode)
  :custom
  (org-superstar-headline-bullets-list '("◉" "◎" "●" "⊙" "○" "●" "◈" "◇"))
  ;; (org-superstar-remove-leading-stars 't)
  (org-superstar-item-bullet-alist '((?* . ?◆) (?+ . ?○) (?- . ?●)))
  :config
  (set-face-attribute 'org-superstar-item nil :height 0.5) 
  ;; :custom-face
  ;; (org-superstar-header-bullet ((t (:inherit 'fixed-pitch))))
  ;; (org-superstar-item ((t (:inherit 'fixed-pitch))))
  )

(use-package org-appear
  :load-path "~/.config/emacs/org-appear"
  :after org
  :init
  (setq org-appear-autolinks 't
        org-appear-autoentities 't
        org-appear-autosubmarkers 't
        org-appear-clearlatex 't)
  :hook (org-mode . org-appear-mode))


(use-package org-fragtog
  :hook (org-mode . org-fragtog-mode))

(use-package org-pretty-table
  :load-path "~/.config/emacs/org-pretty-table"
  :hook (org-mode . org-pretty-table-mode))

;; Automatically tangle our Emacs.org config file when we save it
(defun fab/org-auto-tangle ()
  (when (and (eq major-mode 'org-mode)
             (string-equal (file-name-directory (buffer-file-name))
                           (expand-file-name user-emacs-directory)))
    ;; Dynamic scoping to the rescue
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'fab/org-auto-tangle)))

(general-def 'normal org-mode-map
  "<down>" 'evil-next-visual-line
  "<up>"   'evil-previous-visual-line
  "C-e"    '(lambda () (interactive) (org-edit-special) (evil-normal-state)))

(general-def 'insert org-mode-map
  "C-e"    '(lambda () (interactive) (org-edit-special) (evil-insert-state)))

(general-def '(normal insert) org-src-mode-map
  ;; TODO: Does not work imediatly?
  "C-e" 'org-edit-src-exit)

(fab/leader-def org-mode-map :infix "o"
  ""    '(:ignore t :wk "Org-Mode")
  "g"   '(counsel-org-goto :wk "Goto Counsel")
  "G"   '((lambda () (interactive) (evil-emacs-state) (org-goto) (evil-normal-state)) :wk "Goto")
  "o"   '(org-occur :wk "Occur")

  "s"   '(:ignore t :wk "Src Blocks")
  "s s" '((lambda () (interactive) (beginning-of-line) (org-babel-demarcate-block)) :wk "Split or create")

  "t"   '(:ignore t :wk "Tables")
  "t t" '(org-table-create-or-convert-from-region :wk "Create")
  "t c" '(:ignore t :wk "Columns")
  "t c d" '(org-table-delete-column :wk "Delete")
  "t c i" '(org-table-insert-column :wk "Insert Left")
  "t s" '(org-table-sort-lines :wk "Sort by Column")
  ;; "t d" '(org-table-cut-region :wk "Delete")
  ;; "t y" '(org-table-copy-region :wk "Yank")
  ;; "t p" '(org-table-paste-rectangle :wk "Paste")
  "t i" '(org-table-import :wk "Import")
  "t e" '(org-table-export :wk "Export")

  "m"   '(:ignore t :wk "Modes")
  "m a" '(org-appear-mode :wk "Appear")
  "m f" '(org-fragtog-mode :wk "Fragtog")
  "m F" '((lambda () (interactive) (org-fragtog-mode -1) (org-fragtog-mode 1)) :wk "Fragtog Restart")
  "m e" '(org-toggle-pretty-entities :wk "Entities")
  "m i" '(org-toggle-inline-images :wk "Images")

  "i"   '(:ignore t :wk "Insert")
  "i e" '(counsel-org-entity :wk "Entity")
  "i l" '(org-insert-link :wk "Link")
  "i L" '(counsel-org-link :wk "Link (Headline)")
  "i t" '(org-table-create :wk "Table")
  "i s" '((lambda () (interactive) (beginning-of-line) (org-babel-demarcate-block)) :wk "Source Block")

  "l"   '(org-latex-preview :wk "Latex Preview")

  "T"   '(org-todo :wk "Change TODO")
  "S"   '(org-sort :wk "Sort")
  )
