.config/emacs/Emacs.org
*** Evil Bindings

#+begin_src emacs-lisp
  (defun org-folded-p ()
    "Returns non-nil if point is on a folded headline or plain list item."
    (and (or (org-at-heading-p) (org-at-item-p))
         (invisible-p (point-at-eol))))

  (defun fab/org-evil-list-open-item-above (insert)
    (interactive "P")
    (if insert
        (evil-open-above 1)
      (org-evil-list-open-item-above)))

  (defun fab/org-evil-list-open-item-below (insert)
    (interactive "P")
    (if insert
        (evil-open-below 1)
      (org-evil-list-open-item-below)))

  (defun fab/org-evil-list-insert-item (insert)
    (interactive "P")
    (if insert
        (org-return)
      (org-insert-item (org-at-item-checkbox-p))))

  (defun fab/org-evil-heading-open-sibling-below (insert)
    (interactive "P")
    (if (or insert (org-folded-p))
        (org-evil-heading-open-sibling-below)
      (evil-open-below 1)))

  (defun fab/org-evil-heading-open-sibling-above (insert)
    (interactive "P")
    (if (or insert (org-folded-p))
        (org-evil-heading-open-sibling-above)
      (evil-open-above 1)))

  (evil-define-motion fab/org-evil-heading-beginning-of-line ()
    "Move to the beginning of the current heading."
    :type exclusive
    (org-back-to-heading)
    (re-search-forward "\*+ "))

  (use-package org-evil
    :after org
    :load-path "~/.config/emacs/org-evil"
    :config
    (org-evil--define-key 'normal 'org-evil-list-mode
      "O" 'fab/org-evil-list-open-item-above
      "o" 'fab/org-evil-list-open-item-below)
    (org-evil--define-key 'insert 'org-evil-list-mode
      (kbd "RET") 'fab/org-evil-list-insert-item)
    (org-evil--define-key 'normal 'org-evil-heading-mode
      "O" 'fab/org-evil-heading-open-sibling-above
      "o" 'fab/org-evil-heading-open-sibling-below
      "^" 'fab/org-evil-heading-beginning-of-line))
#+end_src

** Pretty Checkboxes

#+begin_src emacs-lisp
  (defun fab/org-prettify-symbols-setup ()
    (setq prettify-symbols-unprettify-at-point 't)
    (push '("[ ]" . ?) prettify-symbols-alist)
    (push '("[X]" . ?) prettify-symbols-alist)
    (prettify-symbols-mode))

  (add-hook 'org-mode-hook 'fab/org-prettify-symbols-setup)
#+end_src

* Other Stuff

:EXCLUDED-STUFF:
#+begin_src emacs-lisp :tangle no
  (setq line-move-visual nil)
  (visual-line-mode)
  (toggle-word-wrap)
  (setq indicate-empty-lines 't)
  (fringe-mode 3)

  ;; (custom-set-faces
  ;; custom-set-faces was added by Custom.
  ;; If you edit it by hand, you could mess it up, so be careful.
  ;; Your init file should contain only one such instance.
  ;; If there is more than one, they won't work right.
                                          ;  '(term-color-black ((t (:foreground "#3F3F3F" :background "#2B2B2B"))))
                                          ;  '(term-color-blue ((t (:foreground "#7CB8BB" :background "#4C7073"))))
                                          ;  '(term-color-cyan ((t (:foreground "#93E0E3" :background "#8CD0D3"))))
                                          ;  '(term-color-green ((t (:foreground "#7F9F7F" :background "#9FC59F"))))
                                          ;  '(term-color-magenta ((t (:foreground "#DC8CC3" :background "#CC9393"))))
                                          ;  '(term-color-red ((t (:foreground "#AC7373" :background "#8C5353"))))
                                          ;  '(term-color-white ((t (:foreground "#DCDCCC" :background "#656555"))))
                                          ;  '(term-color-yellow ((t (:foreground "#DFAF8F" :background "#9FC59F"))))
                                          ;  '(term-default-bg-color ((t (:inherit term-color-black))))
                                          ;  '(term-default-fg-color ((t (:inherit term-color-white)))))

  (require 'eshell) ; or use with-eval-after-load
  (use-package xterm-color)
  (setq comint-output-filter-functions
        (remove 'ansi-color-process-output comint-output-filter-functions))

  (add-hook 'shell-mode-hook
            (lambda ()
              ;; Disable font-locking in this buffer to improve performance
              (font-lock-mode -1)
              ;; Prevent font-locking from being re-enabled in this buffer
              (make-local-variable 'font-lock-function)
              (setq font-lock-function (lambda (_) nil))
              (add-hook 'comint-preoutput-filter-functions 'xterm-color-filter nil t)))

  (use-package eterm-256color)
  (add-hook 'term-mode-hook #'eterm-256color-mode)

  (use-package vterm)

  (add-hook 'term-mode-hook
            (defun my-term-mode-hook ()
              (setq bidi-paragraph-direction 'left-to-right)))

  ;; Also set TERM accordingly (xterm-256color) in the shell itself.

  ;; An example configuration for eshell


                                          ; (add-hook 'eshell-before-prompt-hook
                                          ;           (lambda ()
                                          ;             (setq xterm-color-preserve-properties t)))

                                          ; (add-to-list 'eshell-preoutput-filter-functions 'xterm-color-filter)
                                          ; (setq eshell-output-filter-functions (remove 'eshell-handle-ansi-color eshell-output-filter-functions))
                                          ; (setenv "TERM" "xterm-256color")

  (with-eval-after-load 'esh-mode
    (add-hook 'eshell-mode-hook
              (lambda () (progn
                           (setq xterm-color-preserve-properties t)
                           (setenv "TERM" "xterm-256color"))))

    (add-to-list 'eshell-preoutput-filter-functions 'xterm-color-filter)

    (setq eshell-output-filter-functions
          (remove 'eshell-handle-ansi-color eshell-output-filter-functions))
    )

  (setq shell-file-name "/bin/bash")

  ;; (use-package helm
  ;;   :defer 2
  ;;   :bind
  ;;   ("M-x" . helm-M-x)
  ;;   ("C-x C-f" . helm-find-files)
  ;;   ("M-y" . helm-show-kill-ring)
  ;;   ("C-x b" . helm-mini)
  ;;   :config
  ;;   (require 'helm-config)
  ;;   (helm-mode 1)
  ;;   (setq helm-split-window-inside-p t
  ;;     helm-move-to-line-cycle-in-source t)
  ;;   (setq helm-autoresize-max-height 0)
  ;;   (setq helm-autoresize-min-height 20)
  ;;   (helm-autoresize-mode 1)
  ;;   (define-key helm-map (kbd "<tab>") 'helm-execute-persistent-action) ; rebind tab to run persistent action
  ;;   (define-key helm-map (kbd "C-z")  'helm-select-action) ; list actions using C-z
  ;;   (define-key helm-find-files-map (kbd "C-k") 'helm-find-files-up-one-level)
  ;; )

  ;; (add-to-list 'load-path "/path-to/emacs-tree-sitter/core")
  ;; (add-to-list 'load-path "/path-to/emacs-tree-sitter/lisp")
  ;; (add-to-list 'load-path "/path-to/emacs-tree-sitter/langs")

  ;; (require 'tree-sitter)
  ;; (require 'tree-sitter-hl)
  ;; (require 'tree-sitter-langs)
  ;; (require 'tree-sitter-debug)
  ;; (require 'tree-sitter-query)

  ;; (use-package tree-sitter)
  ;; (use-package tree-sitter-langs)

  ;; (font-lock-add-keywords 'c-mode
  ;;                    '(("\\<\\([a-zA-Z_]*\\) *("  1 font-lock-function-name-face append)) 'append)

  ;; (use-package good-scroll
  ;;   :config
  ;;   (setq good-scroll-step 50)
  ;;   (setq good-scroll-duration 0.05)
  ;;   (setq good-scroll-render-rate 0.01)
  ;;   (good-scroll-mode 1))

  (custom-set-variables
   ;; custom-set-variables was added by Custom.
   ;; If you edit it by hand, you could mess it up, so be careful.
   ;; Your init file should contain only one such instance.
   ;; If there is more than one, they won't work right.
   '(ansi-color-names-vector
     ["#242424" "#e5786d" "#95e454" "#cae682" "#8ac6f2" "#333366" "#ccaa8f" "#f6f3e8"])
   '(custom-safe-themes 'nil)
   '(package-selected-packages
     '(org-pretty-table evil-surround auto-package-update good-scroll visual-fill-column org-bullets ligature evil-collection doom-themes helpful counsel ivy-rich rainbow-delimiters vterm eterm-256color eterm-color xterm-color which-key evil doom-modeline use-package)))

                                          ; (custom-set-faces
                                          ;  ;; custom-set-faces was added by Custom.
                                          ;  ;; If you edit it by hand, you could mess it up, so be careful.
                                          ;  ;; Your init file should contain only one such instance.
                                          ;  ;; If there is more than one, they won't work right.
                                          ;  '(default ((t (:background "#282c34" :foreground "#eceff4"))))
                                          ;  '(font-lock-comment-face ((t (:foreground "#5c667a"))))
                                          ;  '(font-lock-function-name-face ((t (:foreground "#81a1c1"))))
                                          ;  '(font-lock-type-face ((t (:foreground "#8fbcbb"))))
                                          ;  '(font-lock-variable-name-face ((t (:foreground "#88c0d0")))))
  (custom-set-faces
   ;; custom-set-faces was added by Custom.
   ;; If you edit it by hand, you could mess it up, so be careful.
   ;; Your init file should contain only one such instance.
   ;; If there is more than one, they won't work right.
   '(dired-directory ((t (:inherit font-lock-negation-char-face)))))
#+end_src
:END:

