.config/emacs/init.el

(defun org-folded-p ()
  "Returns non-nil if point is on a folded headline or plain list item."
  (and (or (org-at-heading-p) (org-at-item-p))
       (invisible-p (point-at-eol))))

(defun fab/org-evil-list-open-item-above (insert)
  (interactive "P")
  (if insert
      (evil-open-above 1)
    (org-evil-list-open-item-above)))

(defun fab/org-evil-list-open-item-below (insert)
  (interactive "P")
  (if insert
      (evil-open-below 1)
    (org-evil-list-open-item-below)))

(defun fab/org-evil-list-insert-item (insert)
  (interactive "P")
  (if insert
      (org-return)
    (org-insert-item (org-at-item-checkbox-p))))

(defun fab/org-evil-heading-open-sibling-below (insert)
  (interactive "P")
  (if (or insert (org-folded-p))
      (org-evil-heading-open-sibling-below)
    (evil-open-below 1)))

(defun fab/org-evil-heading-open-sibling-above (insert)
  (interactive "P")
  (if (or insert (org-folded-p))
      (org-evil-heading-open-sibling-above)
    (evil-open-above 1)))

(evil-define-motion fab/org-evil-heading-beginning-of-line ()
  "Move to the beginning of the current heading."
  :type exclusive
  (org-back-to-heading)
  (re-search-forward "\*+ "))

(use-package org-evil
  :after org
  :load-path "~/.config/emacs/org-evil"
  :config
  (org-evil--define-key 'normal 'org-evil-list-mode
    "O" 'fab/org-evil-list-open-item-above
    "o" 'fab/org-evil-list-open-item-below)
  (org-evil--define-key 'insert 'org-evil-list-mode
    (kbd "RET") 'fab/org-evil-list-insert-item)
  (org-evil--define-key 'normal 'org-evil-heading-mode
    "O" 'fab/org-evil-heading-open-sibling-above
    "o" 'fab/org-evil-heading-open-sibling-below
    "^" 'fab/org-evil-heading-beginning-of-line))

(defun fab/org-prettify-symbols-setup ()
  (setq prettify-symbols-unprettify-at-point 't)
  (push '("[ ]" . ?) prettify-symbols-alist)
  (push '("[X]" . ?) prettify-symbols-alist)
  (prettify-symbols-mode))

(add-hook 'org-mode-hook 'fab/org-prettify-symbols-setup)
